app/Http/Controllers/Home/DetailController.php

select * from `article`
---
    public function index()
    {

        //获取Article的数据
		$list = Article::get();