app/Http/Controllers/Home/DetailController.php

    public function index()
    {

        //获取Article的数据

        $res = Article::orderBy("id",'desc')->paginate(15); //15条每页浏览
---
select * from `article` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `article`

    public function edit($id)
    {

        //return $id;
        //获取要修改的单条信息
        $list = Contents::where('id',$id)->find($id); //获取信息
---
select * from `contents` where `id` = '9' and `contents`.`id` = '9' limit 1

    public function nothrough()
    {

        $list = Article::where('status',2)->get();
---
select * from `article` where `status` = '2'

    public function daithrough()
    {

        $list = Article::where('status',3)->get();
---
select * from `article` where `status` = '3'