app/Http/Controllers/Home/DetailsController.php

    public function show($id)
    {
        //echo "111";

        //$art = Article::where("userid","=",$id)->get();

        $art = Article::where("id","=",$id)->get();
---
select * from `article` where `id` = '8'