app/Http/Controllers/Home/DetailsController.php

select * from `article` where `userid` = '293'
---
    public function show($id)
    {
        //echo "111";

        //$art = Article::where("userid","=",$id)->get();

        $art = Article::where("userid","=",$id)->get();