app/Http/Controllers/Home/IndexController.php

select * from `article` where `status` = '1'
select * from `article` where `status` = '1' order by `id` desc limit 2 offset 0
select * from `contents` where `id` = '9' limit 1
---
    public function index()
    {
		//$art = Article::where('status', 1)->get();
		 $art = Article::where('status', 1)->get();
        //dd($art);
        foreach($art as $k=>$v){
            $art[$k]->content = Contents::where("id",$v->cid)->first()->content;