app/Http/Controllers/Home/IndexController.php

    public function index()
    {
		//$art = Article::where('status', 1)->get();
        $art = Article::where('status', 1)->orderBy("id",'desc')->paginate(2);
---
select count(*) as aggregate from `article` where `status` = '1'