app/Http/Controllers/Home/ListController.php

    public function index()
    {
        //
        $art = Article::get()->where('status',1);
		$list = Contents::all();
---
select * from `article` where `status` = '1'
select * from `contents`