app/Http/Controllers/Home/ListController.php

    public function index()
    {
        //
		$list = Article::all();
---
select * from `article`