app/Http/Controllers/Home/ListController.php

    public function index()
    {
        //
        $art = Article::where('status', 1)->orderBy("id",'desc')->paginate(2);
        //dd($art);
        foreach($art as $k=>$v){
            $art[$k]->content = Contents::where("id",$v->cid)->first()->content;
---
select * from `contents` where `id` = '1' limit 1