app/Http/Controllers/Home/LoginController.php

   public function doLogin(Request $request)
   {
       /*  //执行验证码判断
        $mycode = $request->input("mycode");
        $yanzhengma = $request->session()->get('phrase');
        if($mycode !== $yanzhengma){
            return back()->with("msg","验证码错误！".$mycode.":".$yanzhengma);
        } */

        //执行登陆判断
        $account = $request->input("account");
        $password = $request->input("pass");
        //获取对应用户信息
        $user = User::where("account",$account)->first();
---
select * from `user` where `account` = '9@qq.com' limit 1