app/Http/Controllers/Home/PersonalController.php

    public function index()
	{
        //return 1;
		//用session获取当前登录用户的ID

        $id = session("homeuser")->id;

        //dd($id);



        $list = Userinfo::where("userid",$id)->first();
---
select * from `userinfo` where `userid` = '8' limit 1

    public function update(Request $request, $id)

    {
        $id = session("homeuser")->id;

        //echo 'aaaa';
        //var_dump($_REQUEST);
        //执行修改，
        $data = $request->only("account","email","age","sex");

        $date = $request->only("account","phone");
		//图片上传至七牛云
        if($request->hasfile('pic')){

            $file=$request->file('pic');
            $disk = QiniuStorage::disk('qiniu');
            $fileName=md5($file->getClientOriginalName().time().rand()).'.'.$file->getClientOriginalExtension();
            $bool=$disk->put('iwanli/image_'.$fileName,file_get_contents($file->getRealPath()));
            $data['pic'] = $fileName;
        }else{
            $ufirst = \DB::table('userinfo')->where('userid',$id)->first();
            $data['pic'] = $ufirst->pic;
        }
         //dd($data);
        $aa = \DB::table("userinfo")->where("userid",$id)->update($data);
        $dd = \DB::table("user")->where("id",$id)->update($date);
---
select * from `userinfo` where `userid` = '4' limit 1
update `userinfo` set `account` = 'zhangxiao', `email` = '', `age` = '', `sex` = '', `pic` = '29e4d6429228489c4dbc48d29da50688.png' where `userid` = '4'
update `user` set `account` = 'zhangxiao', `phone` = '17610296995' where `id` = '4'