app/Http/Controllers/Home/RegisterController.php

    public function store(Request $request)
    {
		//判断用户名开始
        //获取用户名
        $account = $request->input("account");
        $yong = \DB::table('user')->where("account","=",$account)->first();
        if($yong){
            //用户名存在
            return 1;
        }

        //获取手机名
        $phone = $request->input("phone");
        $info = \DB::table('user')->where("phone","=",$phone)->first();
---
select * from `user` where `account` = 'zhanglei' limit 1
select * from `user` where `phone` is null limit 1