app/Http/Controllers/Admin/ArticleController.php

select * from `Article` where `author` like '%二%' order by `id` desc limit 5 offset 0
select count(*) as aggregate from `Article` where `author` like '%二%'
---
    public function index()
    {
        //
        $db = \DB::table("Article");

       //判断并封装搜索条件
       $params = array();
       if(!empty($_GET['author'])){
           $db->where("author","like","%{$_GET['author']}%");
           $params['author'] = $_GET['author']; //维持搜索条件
       }

       // $list = $db->get(); //获取全部
       $list = $db->orderBy("id",'desc')->paginate(5); //5条每页浏览

select * from `contents` where `id` = '2' and `contents`.`id` = '2' limit 1
---
    public function edit($id)
    {
        //
        $list = Contents::where('id',$id)->find($id); //获取信息